//****************************************************************************************************
// Методы класса. Что такое методы в программировании. Вызов метода класса. Функции.| Уроки C++ #74  
// ---------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// ---------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//****************************************************************************************************
#include <iostream>
#include "utils.h"

using namespace std;

/*---------------------------
*	конструктор класса
*	с параметрами
*	кострукор по умолчанию
----------------------------*/

// Класс - это шаблон по которому создаётся объект

// --- POINT --- 
class Point {
private:			// ....шаблон сингл-тон (конструктор)
	int x;
	int y;

public:

	// Конcтруктор по умолчанию 
	Point()
	{

	}

	// --- Constructor ---
	// Конcтруктор вызывается сам, когда создаётся объект класса
	// (функция которая не вызывается и ничего не вовзращает)
	Point(int x, int y)	// перегрузка констркутора 
	{
		this->x = x;
		this->y = y;
	}

	// --- Getters-Stters ---
	int GetX()				// GET X	
	{
		return this->x;
	}
	int GetY()				// GEY Y
	{
		return this->y;
	}
	void SetX(int x)		// SET X
	{
		this->x = x;
	}
	void SetY(int y)		// SET Y
	{
		this->y = y;
	}

	// --- Method ---
	void Print()			// публичный метод 	
	{
		cout << " X = " << x << "\t Y =  " << y << endl << endl;
	}

};


/***********************
	  === MAIN ===
************************/
int main(int argc, char* argv[])
{
	setlocale(LC_ALL, "ru");

	cout << "\n____________________________________________________________\n" << endl;

	// инициализация через "CONSTRUCTOR" (с перегрузкой)
	Point a(5, 44);
	a.Print();

	Point b(77, 9);
	b.Print();

	Point c(10, 20);
	c.Print();

	// инициализация через "SETTERS-GETTERS" 
	Point d;		// без параметров конструктора (по умолчанию) 
	d.SetX(111);
	d.SetY(222);
	d.Print();


	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}