//******************************************************************************************************************
// Определение методов вне класса. Вынести функцию в из класса. Вынести описание метода вне класса.| Уроки C++ #89
// -----------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -----------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//******************************************************************************************************************

#include <iostream>
#include <string>
#include "utils.h"

using namespace std;

/*----------------------------------------
*	Определение методов вне класса
*	Вынести функцию в из класса
*	Вынести описание метода вне класса
*----------------------------------------*/

class MyClass
{
public:
	void PrintMessage();
};


void MyClass::PrintMessage()
{
	cout << " Hello!" << endl;
}

/***********************
	  === MAIN ===
************************/
int main(int argc, char* argv[])
{

	setlocale(LC_ALL, "ru");
	cout << "\n____________________________________________________________\n" << endl;

	MyClass a;
	a.PrintMessage();

	cout << "\n____________________________________________________________\n" << endl;


	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;

}