//********************************************************************************************************************
// Модификаторы доступа при наследовании. private public protected Спецификаторы доступа. | ООП. C++ | Уроки C++ #99  
// -------------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022
// -------------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//********************************************************************************************************************
#include <iostream>
#include <string>
#include "utils.h"

using namespace std;

/*-------------------------------------------------------
*	Спецификаторы (модификаторы) доступа наследования
*	private, public, protected
*-------------------------------------------------------*/

class A
{
public:													// доступ на всех уровнях
	string msgOne = "Сooбщение oдин (public)";

private:												// доступ только на уровне текущего класса  
	string msgTwo = "Сooбщение два (private)";

protected:												// доступ только на уровне классов наследников
	string msgThree = "Сooбщение три (protected)";

};


class B : public A
{
public:
	void PrintMsg()
	{
		cout << msgOne << endl;
	}
};


/***********************
		  MAIN
************************/
int main(int argc, char* argv[])
{

	setlocale(LC_ALL, "ru");

	cout << "\n____________________________________________________________\n" << endl;

	B b;
	b.PrintMsg();
	b.msgOne;

	cout << "\n____________________________________________________________\n" << endl;

	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;

}
