//*****************************************************************************************************
// Что такое класс. Что такое объект класса. Экземпляр класса это. Класс ООП. | Уроки C++ | Урок #73
// ----------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// ----------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//*****************************************************************************************************

#include <iostream>
#include <string> 
#include "utils.h" 

using namespace std;

/*----------------------------------
*	Что такое класс
*   Что такое объект класса
*
*   Класс - новый тип данных
*	пользовательский тип данных
-----------------------------------*/

//----------------- 
//   класс Human  
//-----------------
class Human
{
public:								// модификатор доступа
	// поля класса (свойства)
	int age;						// возраст			)
	int weight;						// вес
	string name;					// имя
};


//----------------- 
//   класс Point  
//-----------------
class Point {
public:
	int x;
	int y;
	int z;
};

int main(int argc, char* argv[])
{
	setlocale(LC_ALL, "ru");

	// --------------------------------------------------------------------
	// 1. Объект "firstHuman" класса "Human" (экземпляр) - первый человек
	// --------------------------------------------------------------------
	Human firstHuman;

	// наполнить экземпяр класса значениями (свойства/поля класса)
	firstHuman.age = 30;
	firstHuman.weight = 100;
	firstHuman.name = "Ivanov Ivan Ivanovich";

	// вывод на экран 
	cout << firstHuman.age << endl;
	cout << firstHuman.weight << endl;
	cout << firstHuman.name << endl;

	cout << "\n____________________________________________________________\n" << endl;

	// ------------------------------------------
	// 2. Объект "secondtHuman" - второй человек
	// ------------------------------------------
	Human secondtHuman;

	secondtHuman.age = 19;
	secondtHuman.weight = 60;
	secondtHuman.name = "Noname";

	cout << secondtHuman.age << endl;
	cout << secondtHuman.weight << endl;
	cout << secondtHuman.name << endl;

	cout << "\n____________________________________________________________\n" << endl;

	// -----------------------------------
	//  Экземпляр/объект для класса Point
	// -----------------------------------
	Point a;	// объект "a" класса "Point"

	a.x = 1;	// задать координату x
	a.y = 3;	// задать координату y
	a.z = 5;	// задать координату z


	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}
