// *****************************************************************************************************************
// Вызов конструктора базового класса из конструктора класса-наследника. Наследование. | ООП C++  | Уроки C++ #102  
// -----------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -----------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
// *****************************************************************************************************************

#include <iostream>
#include <string>
#include "utils.h"

using namespace std;

/*-----------------------------------------------------------------------
*  Вызов конструктора базового класса из конструктора класса-наследника
*------------------------------------------------------------------------*/

class A
{
public:
	A()														// Конструктор по умолчанию
	{
		//cout << " Вызвался конструктор класса A" << endl;
		msg = "\n Пустое сообщение";
	}

	A(string msg)											// Второй конструктор
	{
		this->msg = msg;
	}

	void PrintMsg()
	{
		cout << msg << endl;
	}

private:
	string msg;

};


class B : public A
{
public:
	B() : A(" наше новое сообщение ")							// определение для второго конструктора из класса "A"
	{
		//cout << " Вызвался конструктор класса B" << endl;
	}
};


class C : public B
{
public:
	C()
	{
		//cout << " Вызвался конструктор класса C" << endl;
	}
};


/***********************
		  MAIN
************************/
int main(int argc, char* argv[])
{
	setlocale(LC_ALL, "ru");

	cout << "\n____________________________________________________________\n" << endl;

	// A a(" - наша строка - ");
	// a.PrintMsg();

	B value;
	value.PrintMsg();

	cout << "\n____________________________________________________________\n" << endl;


	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;

}