//********************************************************
// Работа с файлами с++. Чтение из файла с++ ifstream. 
// Изучение С++ для начинающих. Урок #116
// -------------------------------------------------------
// С++ | Visual Studio 2022 
// -------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//********************************************************

#include <iostream>
#include <string>
#include <fstream>
#include "utils.h"

using namespace std;

/*-------------------------------------------
 * сохранение данных в файл
 * чтение данных из файла
 *------------------------------------------*/
 // К Л А С Ы:
 // fstream		- чтение и запись для файла 
 // ifstream	- чтение данных из файла (write)
 // ofstream	- запись данных в файл (read)

int main(int argc, char* argv[])
{
	setlocale(LC_ALL, "ru");

	// --- R E A D ---	

	cout << "____________________________________________________________\n" << endl;
	string path = "myFile.txt";

	ifstream fin;		// fin - объект-поток вывода из файла 
	fin.open(path);		// окрыть файл на чтение 

	string str;
	if (!fin.is_open())
	{
		cout << " Ошибка открытия файла! " << endl;
	}
	else
	{
		cout << " *** Файл открыт! *** \n" << endl;

		/*-------------------------------------------
		// --- считать посимвольно ---
		char ch;
		while (fin.get(ch))
		{
			cout << ch;
		}
		-------------------------------------------*/

		// --- считать построчно ---
		string str;
		while (!fin.eof())			// если не конец файла
		{
			str = "";
			// fin >> str;			// read string from file (считывание по словам до первого пробела)
			getline(fin, str);		// считывние строки (std::)
			cout << str << endl;
		}

	}
	fin.close();
	cout << "\n____________________________________________________________\n" << endl;

	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}
