// ****************************************************************************************************************
// Виртуальный деструктор класса C++. Что это такое. Наследование. Полиморфизм. | Для начинающих | Уроки C++ #105  
// ----------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// ----------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
// ****************************************************************************************************************
#include <iostream>
#include <string>
#include "utils.h"

using namespace std;

/*--------------------------
* Полиморфизм:
* Виртуальный деструктор
*--------------------------*/

class A
{
public:
	A()
	{
		cout << " => выделена динамическая память, объект класса A " << endl;
	}

	virtual ~A()	// !!! виртуальный десктруктор !!!
	{
		cout << " <= освобождена динамическая память, объект класса A " << endl;
	}
};


class B : public A
{
public:
	B()
	{
		cout << " => выделена динамическая память, объект класса B " << endl;
	}

	~B() override	// переопределить виртуальный деструктор
	{
		cout << " <= освобождена динамическая память, объект класса B " << endl;
	}

};


/***********************
		  MAIN
************************/
int main(int argc, char* argv[])
{

	setlocale(LC_ALL, "ru");

	cout << "\n____________________________________________________________\n" << endl;

	//B b;

	B* bptr = new B;	// выделенме динамической памяти 

	delete bptr;		// освободить дин. память 

	cout << "\n____________________________________________________________\n" << endl;


	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;

}
