//*******************************************************************************************************************
// Вложенные классы с++ пример. Внутренние классы. Зачем нужны. inner class. | ООП. Для начинающих | Уроки C++ #95 
// ------------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// ------------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//*******************************************************************************************************************
#include <iostream>
#include <string>
#include "utils.h"

using namespace std;

/*--------------------------------------------------------------------------------
*  inner class
*
*  Внутренний класс - это класс, реализованный внутри другого класса
*  Объемлющий класс - это основной класс
*  Вложенный класс может находится в любой секции (public, private, protected)
*--------------------------------------------------------------------------------*/

class Image								// Class "Image"      
{

	/*-----------------------------------------------------
					PIXEL (Innner Class)
			  "Pixel" - Класс массива пикселей
	-----------------------------------------------------*/
public:

	class Pixel
	{
	private:
		int r;
		int g;
		int b;

	public:
		Pixel(int r, int g, int b)		// конструктор для пикселя
		{
			this->r = r;
			this->g = g;
			this->b = b;
		}

		string GetInfo()				// метод (info about pixel)
		{
			return "  Pixel:  r = " + to_string(r) + "\tg = " + to_string(g) + "\t\tb = " + to_string(b);
		}

	}; // --- end inner class "Pixel" ---


	/*-----------------------------------------
		GetImageInfo() - class Image / public
	 -----------------------------------------*/
	void GetImageInfo()		// Вывод данных о массиве пиксилей (class/public "Image") 				
	{
		for (int i = 0; i < LENGTH; i++)
		{
			cout << "#" << i << " " << pixels[i].GetInfo() << endl;
		}
	}

	/*----------------------------
		 Class Image / private
	 ----------------------------*/
private:

	static const int LENGTH = 5;		// для константы - обязательно "static"

	Pixel pixels[LENGTH]				// массив с пикселями
	{
		Pixel(0, 4, 64),				// объект (экземпляр) ...
		Pixel(4, 14, 10),
		Pixel(111, 4, 24),
		Pixel(244, 244, 14),
		Pixel(111, 244, 14)
	};

	int r;
	int g;
	int b;

};


/*********************************
		   === MAIN ===
**********************************/
int main(int argc, char* argv[])
{

	setlocale(LC_ALL, "ru");

	cout << "\n____________________________________________________________\n" << endl;

	Image img;							// создать объект "img" класса "Image"	
	img.GetImageInfo();					// инфо о целом объекте "img"

	puts("============================================================");

	Image::Pixel pixel(24, 44, 11);		// создать пиксел
	cout << pixel.GetInfo();			// вывести инфо об одном пикселе

	cout << "\n____________________________________________________________\n" << endl;


	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;

}
