//***************************************************************************************************
// Чтение и запись в файл с++ используя класс fstream c++. Изучение С++ для начинающих. | Урок #118 
// --------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// --------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//***************************************************************************************************

#include <iostream>
#include <string>
#include <fstream>
#include "utils.h"
#include <Windows.h> 

using namespace std;

/*---------------------------------------
 * fstream чтение/сохранение данных
 *--------------------------------------*/

int main(int argc, char* argv[])
{
	setlocale(LC_ALL, "ru");

	cout << "\n____________________________________________________________\n" << endl;
	string path = "myFile.txt";
	fstream fs;
	fs.open(path, fstream::in | fstream::out | fstream::app);	// запись-чтение с добавлением в конец файла - через битовое "ИЛИ" 

	if (!fs.is_open())
	{
		cout << " Ошибка открытия файла! " << endl;
	}
	else
	{
		string msg;
		int value;
		cout << " Файл открыт! " << endl;
		cout << " Нажмите \"1\" для записи сообщения в файл: " << endl;
		cout << " Нажмите \"2\" для считывания всех сообщениий из файла: " << endl;
		cin >> value;

		/*-------------------------------------------------------------------------------
		if (value == 1)		// запись
		{
			cout << "\n Введите ваше сообщение! \n" << endl;
			SetConsoleCP(1251);
			cin >> msg;
			fs << msg << "\n";
			SetConsoleCP(866);
		}
		if (value == 2)		// чтение
		{
			cout << "\n Чтение данных из файла! \n" << endl;
			while (!fs.eof())
			{
				msg = "";
				fs >> msg;
				cout << msg << endl;
			}
		}
	-------------------------------------------------------------------------------*/
		switch (value)
		{
		case 1:
		{
			cout << "---------------------------\n";
			cout << " Введите ваше сообщение: \n";
			cout << "---------------------------\n";
			SetConsoleCP(1251);	// переключить кодировку для записи кирилицы  			
			cin >> msg;
			fs << msg << "\n";	// запись в файл (по словам до пробела)
			SetConsoleCP(866);	// восстановить стандартную win-кордиорвку
			break;
		}
		case 2:
		{
			cout << "---------------------------\n";
			cout << " Чтение данных из файла : \n";
			cout << "---------------------------\n";
			while (!fs.eof())
			{
				msg = "";				// очистить буфер сообщений 
				fs >> msg;				// вывод из файла в буфер (по словам до пробела)
				cout << msg << endl;	// вывод на консоль 
				//getline(fs, msg);
				//cout << msg << endl;
			}
			break;
		}
		default:
		{
			cout << "ERROR: Некоректный ввод !" << endl;
			break;
		}

		} // --- end witch ---
	} // --- end else ---- 

	fs.close();
	cout << "\n____________________________________________________________\n" << endl;


	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}
