//*******************************************************************************************************************
// Массив объектов класса. Динамический. Статический. Создание Особенности. ООП C++ | Для начинающих| Уроки C++ #96
// ------------------------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// ------------------------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//*******************************************************************************************************************

#include <iostream>
#include <string>
#include "utils.h"

using namespace std;

/*----------------------------
*	Массив объектов класса
*----------------------------*/

class Pixel							// Class "Pixel"      
{

public:

	Pixel()							// Конструктор по умолчанию
	{
		r = g = b = 0;
	}

	Pixel(int r, int g, int b)		// Конструктор для пикселя
	{
		this->r = r;
		this->g = g;
		this->b = b;
	}

	string GetInfo()
	{
		return "Pixel:   r = " + to_string(r) + "  g = " + to_string(g) + "  b = " + to_string(b);
	}

private:

	int r;
	int g;
	int b;

};


/***********************
		  MAIN
************************/
int main(int argc, char* argv[])
{

	setlocale(LC_ALL, "ru");

	cout << "\n____________________________________________________________\n" << endl;

	const int LENGTH = 5;

	//Pixel p(11, 44, 112);										// эмелент пиксел 
	//Pixel arr[LENGTH];										// Массив
	//arr[0] = Pixel(11, 159, 222);
	//cout << arr[0].GetInfo() << endl;


	Pixel arr1[LENGTH]											// статический массив 
	{
		Pixel(0, 4, 64),
		Pixel(4, 14, 10),
		Pixel(111, 4, 24),
		Pixel(244, 244, 14),
		Pixel(111, 244, 14)
	};
	cout << "ARR1 (STATIC): " << arr1[0].GetInfo() << endl;		// вывод для 1-го эл-та.


	Pixel* arr2 = new Pixel[LENGTH];							// динамический массив
	arr2[0] = Pixel(11, 151, 44);
	cout << "ARR2 (DYNAMIC): " << arr2[0].GetInfo() << endl;	// вывод для 1-го эл-та.
	delete[]arr2;												// освободить память

	// Pixel rgb(255, 255, 255);
	// Pixel rgb{ 255, 255, 255 };
	// cout << rgb.GetInfo() << endl;

	cout << "\n____________________________________________________________\n" << endl;

	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;

}