//******************************************************************************************************
// Методы класса. Что такое методы в программировании. Вызов метода класса. Функции.| Уроки C++ #74  
// -----------------------------------------------------------------------------------------------------
// С++ | Visual Studio 2022 
// -----------------------------------------------------------------------------------------------------
// Журавлёв Сергей | #SimpleCode | Udemy
// https://www.udemy.com/user/zhuravliov-sergei/
// 2019-2023 @ sgiman
//******************************************************************************************************
#include <iostream>
#include "utils.h"

using namespace std;

/*------------------------------------------------------------------------
*	перегрузка конструкторов класса
*
*   Прегрегрузка конструктора классов очень похожа на перегрузку функций.
*
*   Перегрузка это один из видов полиморфизма,
*   когда меняется поведние объектов в засимости от разных ситуаций.
*------------------------------------------------------------------------*/

// Constructors + Getter-Setter + Methods

class Point {

private:
	int x;
	int y;

public:

	// --- КОНСТРУКТОРЫ ---

	Point()								// Конcтруктор по умолчанию (инициализация данных)
	{
		this->x = 0;
		this->y = 0;
	}

	Point(int x, int y)					// Второй конcтруктор c парметрами (не вызывается извне) для перезагрузки 
	{
		this->x = x;
		this->y = y;
	}

	Point(int valueX, bool boolean)		// Третий конструктор (bool)
	{
		this->x = valueX;

		if (boolean)
		{
			this->y = 1;
		}
		else
		{
			this->y = -1;
		}
	}

	// --- СЕТЕРЫ-ГЕТЕРЫ ---

	int GetX()				// GETTER !	для поля X 	
	{
		return this->x;		// вернуть значене "x"
	}

	void SetX(int x)		// SETTER ! параметер "valuaX" не должен быть "x" из области доступа private - для поля X 
	{
		this->x = x;		// уcтановить "x"
	}

	int GetY()				// GETTER !	для поля Y	
	{
		return this->y;
	}

	void SetY(int y)		// SETTER ! для поля Y
	{
		this->y = y;
	}

	// --- МЕТОДЫ ---

	void Print()			// публичный метод 	
	{
		cout << " X = " << this->x << "\t Y =  " << this->y << endl << endl;
	}

};


/***********************
	  === MAIN ===
************************/
int main(int argc, char* argv[])
{
	setlocale(LC_ALL, "ru");

	cout << "\n____________________________________________________________\n" << endl;

	//Point a(5, 44);
	Point a;			// объект для первого конструктра (по умолчанию)
	a.Print();

	Point b(77, 9);		// объект для второго конструктра (перезагрузка)
	b.Print();

	Point c(22, false);	// объект для третьего конструктора (перезагрузка)
	c.Print();


	//=== END ===
	cout << endl;
	MyDate();
	system("pause");
	return 0;
}